Ran Plan for project: `prod-emnify` dir: `finance_revenue_report_s3_to_redshift/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.business-etl.aws_glue_catalog_database.csv_catalog will be created
+ resource "aws_glue_catalog_database" "csv_catalog" {
      + catalog_id  = (known after apply)
      + description = "glue catalog for CSV files on S3"
      + id          = (known after apply)
      + name        = "prod-emnify-business-etl-csv"
    }

  # module.business-etl.aws_glue_catalog_database.redshift_catalog will be created
+ resource "aws_glue_catalog_database" "redshift_catalog" {
      + catalog_id  = (known after apply)
      + description = "glue catalog for all tables, used in the ETL jobs"
      + id          = (known after apply)
      + name        = "prod-emnify-business-etl-catalog"
    }

  # module.business-etl.aws_glue_classifier.csv_classifier will be created
+ resource "aws_glue_classifier" "csv_classifier" {
      + id   = (known after apply)
      + name = "prod-emnify-business-etl-csv-classifier"

      + csv_classifier {
          + allow_single_column    = false
          + contains_header        = "PRESENT"
          + delimiter              = ","
          + disable_value_trimming = false
          + quote_symbol           = "\""
        }
    }

  # module.business-etl.aws_glue_connection.redshift_etl will be created
+ resource "aws_glue_connection" "redshift_etl" {
      + catalog_id            = (known after apply)
      + connection_properties = (sensitive value)
      + connection_type       = "JDBC"
      + description           = "connection to redshift data warehouse"
      + id                    = (known after apply)
      + name                  = "prod-emnify-redshift"

      + physical_connection_requirements {
          + availability_zone      = "eu-west-1a"
          + security_group_id_list = (known after apply)
          + subnet_id              = "subnet-067f8c2ac80e406b1"
        }
    }

  # module.business-etl.aws_glue_crawler.csv_crawler will be created
+ resource "aws_glue_crawler" "csv_crawler" {
      + arn           = (known after apply)
      + classifiers   = [
          + "prod-emnify-business-etl-csv-classifier",
        ]
      + database_name = "prod-emnify-business-etl-csv"
      + id            = (known after apply)
      + name          = "prod-emnify-csv"
      + role          = "prod-emnify-business-etl-glue-role"
      + schedule      = "cron(0 0 * * ? *)"

      + s3_target {
          + path = "prod-emnify-business-etl-invoice-csv/"
        }
    }

  # module.business-etl.aws_glue_crawler.redshift will be created
+ resource "aws_glue_crawler" "redshift" {
      + arn           = (known after apply)
      + database_name = "prod-emnify-business-etl-catalog"
      + id            = (known after apply)
      + name          = "prod-emnify-redshift"
      + role          = "prod-emnify-business-etl-glue-role"

      + jdbc_target {
          + connection_name = "prod-emnify-redshift"
          + exclusions      = [
              + "v_**",
            ]
          + path            = "dw/public/%"
        }
    }

  # module.business-etl.aws_glue_job.s3_to_redshift_etl will be created
+ resource "aws_glue_job" "s3_to_redshift_etl" {
      + allocated_capacity = (known after apply)
      + arn                = (known after apply)
      + connections        = [
          + "prod-emnify-redshift",
        ]
      + default_arguments  = {
          + "--CATALOG"                          = "prod-emnify-business-etl-catalog"
          + "--REDSHIFT_CONNECTION"              = "prod-emnify-redshift"
          + "--TempDir"                          = "s3://aws-glue-prod-emnify-business-etl-temp-eu-west-1"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-metrics"                   = ""
          + "--job-bookmark-option"              = "job-bookmark-enable"
          + "--job-language"                     = "python"
        }
      + description        = "glue job for uploading data from S3 to Redshift"
      + glue_version       = "1.0"
      + id                 = (known after apply)
      + max_capacity       = 2
      + name               = "prod-emnify-s3-to-redshift-etl"
      + role_arn           = (known after apply)
      + timeout            = 180

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + script_location = "s3://aws-glue-prod-emnify-business-etl-temp-eu-west-1/prod-emnify-load_data_from_S3ToRedshift.py"
        }

      + execution_property {
          + max_concurrent_runs = (known after apply)
        }
    }

  # module.business-etl.aws_glue_trigger.s3_daily_trigger will be created
+ resource "aws_glue_trigger" "s3_daily_trigger" {
      + arn         = (known after apply)
      + description = "Trigger the ETL glue job, once a day Monday through Friday at midnight"
      + enabled     = true
      + id          = (known after apply)
      + name        = "prod-emnify-s3-daily-trigger"
      + schedule    = "cron(10 0 ? * MON-FRI *)"
      + type        = "SCHEDULED"

      + actions {
          + arguments = {
              + "--job-bookmark-option" = "job-bookmark-disable"
            }
          + job_name  = "prod-emnify-s3-to-redshift-etl"
        }
    }

  # module.business-etl.aws_iam_policy.iam_policy_for_glue_job will be created
+ resource "aws_iam_policy" "iam_policy_for_glue_job" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "prod-emnify-business-etl-policy"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = {
                  + Action   = "*"
                  + Effect   = "Allow"
                  + Resource = "*"
                }
              + Version   = "2012-10-17"
            }
        )
    }

  # module.business-etl.aws_iam_policy_attachment.glue_policy_attachment will be created
+ resource "aws_iam_policy_attachment" "glue_policy_attachment" {
      + id         = (known after apply)
      + name       = "prod-emnify-business-etl-policy-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "prod-emnify-business-etl-glue-role",
        ]
    }

  # module.business-etl.aws_iam_role.iam_assume_role_for_glue will be created
+ resource "aws_iam_role" "iam_assume_role_for_glue" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-emnify-business-etl-glue-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.business-etl.aws_s3_bucket.finance_etl_glue_temp will be created
+ resource "aws_s3_bucket" "finance_etl_glue_temp" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "aws-glue-prod-emnify-business-etl-temp-eu-west-1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "business-etl"
          + "Instance"    = "emnify"
          + "Name"        = "glue_temp_script_bucket"
          + "Stage"       = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 1
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.business-etl.aws_s3_bucket.finance_etl_invoice_bucket will be created
+ resource "aws_s3_bucket" "finance_etl_invoice_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "prod-emnify-business-etl-invoice-csv"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 1
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.business-etl.aws_s3_bucket_object.s3_to_redshift_script will be created
+ resource "aws_s3_bucket_object" "s3_to_redshift_script" {
      + acl                    = "private"
      + bucket                 = "aws-glue-prod-emnify-business-etl-temp-eu-west-1"
      + content_type           = (known after apply)
      + etag                   = "134ce02ce6ad053f1ba8822ad406db65"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "prod-emnify-load_data_from_S3ToRedshift.py"
      + server_side_encryption = (known after apply)
      + source                 = "../../finance_revenue_report_s3_to_redshift/load_data_from_S3ToRedshift.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Application" = "business-etl"
          + "Instance"    = "emnify"
          + "Name"        = "load_data_from_S3ToRedshift.py"
          + "Stage"       = "prod"
        }
      + version_id             = (known after apply)
    }

  # module.business-etl.aws_security_group.glue_s3_to_redshift will be created
+ resource "aws_security_group" "glue_s3_to_redshift" {
      + arn                    = (known after apply)
      + description            = "Glue to connect to S3 and Redshift"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "prod-emnify-business-etl-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "business-etl"
          + "Instance"    = "emnify"
          + "Name"        = "glue_s3_to_redshift"
          + "Stage"       = "prod"
        }
      + vpc_id                 = "vpc-0044044a0b27b096f"
    }

  # module.business-etl.aws_security_group_rule.glue_allow_all_outbound will be created
+ resource "aws_security_group_rule" "glue_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "allow everyone for any outbound port"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.business-etl.aws_security_group_rule.glue_allow_sec_group_self will be created
+ resource "aws_security_group_rule" "glue_allow_sec_group_self" {
      + description              = "allow self"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.business-etl.aws_security_group_rule.glue_allow_to_redshift_sg will be created
+ resource "aws_security_group_rule" "glue_allow_to_redshift_sg" {
      + description              = "allow Redshift access for business-etl"
      + from_port                = 5439
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0139b2b094865fa3b"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5439
      + type                     = "ingress"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod-emnify`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.oss-eks.emnify.net/lock?id=EMnify%252Fbusiness-etl%252Ffinance_revenue_report_s3_to_redshift%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod-emnify`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
